___________________________________________________________
Layer (type)                 Output Shape          Param #
===========================================================
conv2d_1 (Conv2D)            (None, 28, 28, 6)     156
___________________________________________________________
average_pooling2d_1 (Average (None, 14, 14, 6)     0
___________________________________________________________
conv2d_2 (Conv2D)            (None, 10, 10, 16)    2416
___________________________________________________________
average_pooling2d_2 (Average (None, 5, 5, 16)      0
___________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 1, 120)     48120
___________________________________________________________
flatten_1 (Flatten)          (None, 120)           0
___________________________________________________________
dense_1 (Dense)              (None, 84)            10164
___________________________________________________________
dense_2 (Dense)              (None, 10)            850
===========================================================
Total params: 61,706
Trainable params: 61,706
Non-trainable params: 0
___________________________________________________________

   32/10000 [..............................] - ETA: 22s
  256/10000 [..............................] - ETA: 4s
  480/10000 [>.............................] - ETA: 3s
...
 9664/10000 [===========================>..] - ETA: 0s
 9856/10000 [============================>.] - ETA: 0s
10000/10000 [==============================] - 3s 320us/step
Test loss: 0.04253822890962474
Test accuracy: 0.987